using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Customer : MonoBehaviour
{
 //TOdo 구현할 목록 = 
 /*     //todo 1. 게임 진행중 랜덤하게 등장해야함 
        todo 2.각 손님이 가진 취향과 좋아하는 수치가 랜덤하게 나옴
        todo 3. 각 손님의 얼굴은 스프라이트 리스트에서 랜덤값으로 하나 씩 가져옴 
        ! 신경써야 하는 부분 
        ! 1. 손님받는 시간과 손님을 받지 않는 시간을 구분해야함 - 게임메니저에서 인게임 타이머를 만들 필요가 있음
        ! 2. 지금 당장은 눈코입의 여러가지 스프라이트 모양을 가지고 있지 않음
        ! 3. 그릇에 담아서 or 냄비째로 손님에게 나갈 때 상황을 구분할 수 있는 변수가 필요함  
 */ 

    //? 5.10~~  인게임 타이머를 생성해서 손님이 들어오고 나가는 시간을 구분하기 
    //? ++ 손님이라는 오브젝트를 간단히 만들어서 랜덤한 시간에 등장하도록 만들기 
}
